Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/atdf/PIC32CK2051GC01100.atdf
      <value-group name="MODE2_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="MODE0_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="MODE0_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="MODE1_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="MODE1_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLB__DEBF">
        <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLB__ACTF">
        <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
        <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
        <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
        <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
        <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
        <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
        <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
        <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN0ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN0 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN1ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN1 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN2ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN3ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN4ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN4 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN5ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN5 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN6ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2"/>
        <value name="ACTL" caption="Compare IN6 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3"/>
      </value-group>
