Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/atdf/PIC32CK2051GC01100.atdf
        <register name="ID_PFR1" offset="0x44" rw="R" size="4" access-size="4" initval="0x00000200" caption="Processor Feature Register 1">
          <bitfield name="Security" caption="Security Extension implemented" mask="0xF0"/>
          <bitfield name="MProgMod" caption="M programmer's model" mask="0xF00"/>
        </register>
        <register name="ID_DFR0" offset="0x48" rw="R" size="4" access-size="4" initval="0x00200000" caption="Debug Feature Register 0">
          <bitfield name="MProgDbg" caption="M-profile debug" mask="0xF00000"/>
        </register>
        <register name="ID_AFR0" offset="0x4C" rw="R" size="4" access-size="4" caption="Auxiliary Feature Register 0">
          <bitfield name="IMPDEF0" caption="Implementation defined feature 0" mask="0xF"/>
          <bitfield name="IMPDEF1" caption="Implementation defined feature 1" mask="0xF0"/>
          <bitfield name="IMPDEF2" caption="Implementation defined feature 2" mask="0xF00"/>
          <bitfield name="IMPDEF3" caption="Implementation defined feature 3" mask="0xF000"/>
        </register>
        <register name="ID_MMFR0" offset="0x50" rw="R" size="4" access-size="4" caption="Memory Model Feature Register 0">
          <bitfield name="PMSA" caption="Protected Memory System Architecture" mask="0xF0"/>
          <bitfield name="OuterShr" caption="Outermost Shareability" mask="0xF00"/>
          <bitfield name="ShareLvl" caption="Shareability Levels" mask="0xF000"/>
          <bitfield name="TCM" caption="Tightly Coupled Memories" mask="0xF0000"/>
          <bitfield name="AuxReg" caption="Auxiliary Registers" mask="0xF00000"/>
        </register>
        <register name="ID_MMFR1" offset="0x54" rw="R" size="4" access-size="4" initval="0x00000000" caption="Memory Model Feature Register 1">
        </register>
        <register name="ID_MMFR2" offset="0x58" rw="R" size="4" access-size="4" caption="Memory Model Feature Register 2">
          <bitfield name="WFIStall" caption="Wait For Interrupt stalling" mask="0xF000000"/>
        </register>
        <register name="ID_MMFR3" offset="0x5C" rw="R" size="4" access-size="4" caption="Memory Model Feature Register 3">
          <bitfield name="CMaintVA" caption="Cache maintenance by address" mask="0xF"/>
          <bitfield name="CMaintSW" caption="Cache maintenance set/way" mask="0xF0"/>
          <bitfield name="BPMaint" caption="Branch predictor maintenance" mask="0xF00"/>
        </register>
        <register name="ID_ISAR0" offset="0x60" rw="R" size="4" access-size="4" initval="0x01101110" caption="Instruction Set Attribute Register 0">
          <bitfield name="BitCount" caption="Bit count instructions" mask="0xF0" values="ID_ISAR0__BitCount"/>
          <bitfield name="BitField" caption="Bit field instructions" mask="0xF00" values="ID_ISAR0__BitField"/>
          <bitfield name="CmpBranch" caption="Compare and Branch instructions" mask="0xF000" values="ID_ISAR0__CmpBranch"/>
          <bitfield name="Coproc" caption="Coprocessor instructions" mask="0xF0000" values="ID_ISAR0__Coproc"/>
          <bitfield name="Debug" caption="Debug instructions" mask="0xF00000" values="ID_ISAR0__Debug"/>
          <bitfield name="Divide" caption="Divide instructions" mask="0xF000000" values="ID_ISAR0__Divide"/>
        </register>
        <register name="ID_ISAR1" offset="0x64" rw="R" size="4" access-size="4" initval="0x02211000" caption="Instruction Set Attribute Register 1">
          <bitfield name="Extend" caption="Extend instructions" mask="0xF000" values="ID_ISAR1__Extend"/>
          <bitfield name="IfThen" caption="If-Then instructions" mask="0xF0000" values="ID_ISAR1__IfThen"/>
          <bitfield name="Immediate" caption="Data-processing instructions with long immediates" mask="0xF00000" values="ID_ISAR1__Immediate"/>
          <bitfield name="Interwork" caption="Interworking instructions" mask="0xF000000" values="ID_ISAR1__Interwork"/>
        </register>
        <register name="ID_ISAR2" offset="0x68" rw="R" size="4" access-size="4" initval="0x20112032" caption="Instruction Set Attribute Register 2">
          <bitfield name="LoadStore" caption="Additional load/store instructions" mask="0xF" values="ID_ISAR2__LoadStore"/>
          <bitfield name="MemHint" caption="Memory hint instructions" mask="0xF0" values="ID_ISAR2__MemHint"/>
          <bitfield name="MultiAccessInt" caption="Interruptible multi-access instructions" mask="0xF00" values="ID_ISAR2__MultiAccessInt"/>
          <bitfield name="Mult" caption="Additional Multiply instructions" mask="0xF000" values="ID_ISAR2__Mult"/>
          <bitfield name="MultS" caption="Advanced signed Multiply instructions" mask="0xF0000" values="ID_ISAR2__MultS"/>
          <bitfield name="MultU" caption="Advanced unsigned Multiply instructions" mask="0xF00000" values="ID_ISAR2__MultU"/>
          <bitfield name="Reversal" caption="Reversal instructions" mask="0xF0000000" values="ID_ISAR2__Reversal"/>
        </register>
        <register name="ID_ISAR3" offset="0x6C" rw="R" size="4" access-size="4" initval="0x01111110" caption="Instruction Set Attribute Register 3">
          <bitfield name="Saturate" caption="Saturating instructions" mask="0xF" values="ID_ISAR3__Saturate"/>
          <bitfield name="SIMD" caption="Single-instruction, multiple-data instructions" mask="0xF0" values="ID_ISAR3__SIMD"/>
          <bitfield name="SVC" caption="Supervisor Call instructions" mask="0xF00" values="ID_ISAR3__SVC"/>
          <bitfield name="SynchPrim" caption="Synchronization primitive instructions" mask="0xF000" values="ID_ISAR3__SynchPrim"/>
          <bitfield name="TabBranch" caption="Table Branch instructions" mask="0xF0000" values="ID_ISAR3__TabBranch"/>
          <bitfield name="T32Copy" caption="T32 non flag-setting MOV instructions" mask="0xF00000" values="ID_ISAR3__T32Copy"/>
          <bitfield name="TrueNOP" caption="True NOP instructions" mask="0xF000000" values="ID_ISAR3__TrueNOP"/>
        </register>
        <register name="ID_ISAR4" offset="0x70" rw="R" size="4" access-size="4" initval="0x01310131" caption="Instruction Set Attribute Register 4">
          <bitfield name="Unpriv" caption="Unprivileged instructions" mask="0xF" values="ID_ISAR4__Unpriv"/>
          <bitfield name="WithShifts" caption="Constant shifts instructions" mask="0xF0" values="ID_ISAR4__WithShifts"/>
          <bitfield name="Writeback" caption="Writeback addressing modes" mask="0xF00" values="ID_ISAR4__Writeback"/>
          <bitfield name="Barrier" caption="Barrier instructions" mask="0xF0000" values="ID_ISAR4__Barrier"/>
          <bitfield name="SyncPrim_frac" caption="Synchronization primitives fractional instructions" mask="0xF00000" values="ID_ISAR4__SyncPrim_frac"/>
          <bitfield name="PSR_M" caption="M profile instructions to modify the Program Status Registers" mask="0xF000000" values="ID_ISAR4__PSR_M"/>
        </register>
        <register name="ID_ISAR5" offset="0x74" rw="R" size="4" access-size="4" initval="0x00000000" caption="Instruction Set Attribute Register 5">
        </register>
        <register name="CLIDR" offset="0x78" rw="R" size="4" access-size="4" caption="Cache Level ID Register">
          <bitfield name="Ctype1" caption="Cache type at level 1" mask="0x7" values="CLIDR__Ctype"/>
          <bitfield name="Ctype2" caption="Cache type at level 2" mask="0x38" values="CLIDR__Ctype"/>
          <bitfield name="Ctype3" caption="Cache type at level 3" mask="0x1C0" values="CLIDR__Ctype"/>
          <bitfield name="Ctype4" caption="Cache type at level 4" mask="0xE00" values="CLIDR__Ctype"/>
          <bitfield name="Ctype5" caption="Cache type at level 5" mask="0x7000" values="CLIDR__Ctype"/>
          <bitfield name="Ctype6" caption="Cache type at level 6" mask="0x38000" values="CLIDR__Ctype"/>
          <bitfield name="Ctype7" caption="Cache type at level 7" mask="0x1C0000" values="CLIDR__Ctype"/>
          <bitfield name="LoUIS" caption="Level of Unification Inner Shareable" mask="0xE00000"/>
          <bitfield name="LoC" caption="Level of Coherence" mask="0x7000000"/>
          <bitfield name="LoUU" caption="Level of Unification Uniprocessor" mask="0x38000000"/>
          <bitfield name="ICB" caption="Inner cache boundary" mask="0xC0000000" values="CLIDR__ICB"/>
        </register>
